app/controllers/ads_controller.rb

  def new
  @vehicles = Vehicle.all
    Vehicle.find_by_model_id(Model.find(1).id)
---
SELECT `vehicles`.* FROM `vehicles`
SELECT `vehicles`.* FROM `vehicles` WHERE `vehicles`.`model_id` = 1 LIMIT 1

  def showAds
    @ads = User.find(session[:user_id]).ads
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1